n = input(' مبلغ مورد نظر را به حروف وارد کنید : ')
n = n.replace('یکصد', 'صد')
n = n.split()
for i in n:
    if i == "و" or i == 'تومان':
        n.remove(i)

yekan = ['یک', 'دو', 'سه', 'چهار', 'پنج', 'شش', 'هفت', 'هشت', 'نه']
dahgan = ['بیست', 'سی', 'چهل', 'پنجاه', 'شصت', 'هفتاد', 'هشتاد', 'نود']
sadgan = ['صد', 'دویست', 'سیصد', 'چهارصد', 'پانصد', 'ششصد', 'هفتصد', 'هشتصد', 'نهصد']
dahta = ['ده', 'یازده', 'دوازده', 'سیزده', 'چهارده', 'پانزده', 'شانزده', 'هفده', 'هجده', 'نوزده']
li = {'': '', ' ': 0, 'صفر': 0, 'یک': 1, 'دو': 2, 'سه': 3, 'چهار': 4, 'پنج': 5, 'شش': 6, 'هفت': 7, 'هشت': 8, 'نه': 9, 'ده': 10,
      'یازده': 11, 'دوازده': 12,
      'سیزده': 13, 'چهارده': 14, 'پانزده': 15, 'شانزده': 16, 'هفده': 17, 'هجده': 18, 'نوزده': 19, 'بیست': 2, 'سی': 3,
      'چهل': 4,
      'پنجاه': 5, 'شصت': 6, 'هفتاد': 7, 'هشتاد': 8, 'نود': 9, 'صد': 1, 'دویست': 2, 'سیصد': 3, 'چهارصد': 4, 'پانصد': 5,
      'ششصد': 6, 'هفتصد': 7, 'هشتصد': 8, 'نهصد': 9}
data = ['', 'هزار', 'میلیون', 'میلیارد', 'تریلیون', 'کوآدریلیون', 'کوینتیلیون', 'سکستیلیون',
        'سپتیلیون', 'اکتیلیون', 'نانیلیون', 'دسیلیون', 'آندسیلیون', 'دیودسیلیون', 'تریدسیلیون',
        'کواتیوردسیلیون', 'کویندسیلیون', 'سکسدسیلیون', 'سپتدسیلیون', 'اکتودسیلیون', 'نومدسیلیون']
big = {'هزار': 3, 'میلیون': 6, 'میلیارد': 9, 'تریلیون': 12, 'کوآدریلیون': 15, 'کوینتیلیون': 18, 'سکستیلیون': 21,
       'سپتیلیون': 24,
       'اکتیلیون': 27, 'نانیلیون': 30, 'دسیلیون': 33, 'آندسیلیون': 36, 'دیودسیلیون': 39, 'تریدسیلیون': 42,
       'کواتیوردسیلیون': 45,
       'کویندسیلیون': 48, 'سکسدسیلیون': 51, 'سپتدسیلیون': 54, 'اکتودسیلیون': 57, 'نومدسیلیون': 60}

x = []
c = 0
m = 0
B = ''
check = True
for i in n:
    for j in big:
        if i == j:
            if check:
                B = j
                check = False
            m = big[i]
            x += [n[c:n.index(i)]]
            c = n.index(i)
            x += [[j]]
            n.remove(j)
else:
    x += [n[c:len(n)]]

k = [i for i in data[0:data.index(B) + 1]]
k.reverse()
k.pop()
o = 1

for i in range(len(k)):
    if len(x) > o and x[o][0] == k[i]:
        pass
    else:
        x.insert(o - 1, [' ', ' ', ' '])
        x.insert(o, [k[i]])
    o += 2
for i in range(len(x)):
    if len(x[i]) < 3:
        if len(x[i]) == 0:
            x.insert(i, [' ', ' ', ' '])

        if len(x[i]) == 1:
            if x[i][0] in yekan:
                x[i].insert(0, ' ')
                x[i].insert(1, ' ')
            elif x[i][0] in dahgan:
                x[i].insert(0, ' ')
                x[i].insert(2, ' ')
            elif x[i][0] in sadgan:
                x[i].insert(1, ' ')
                x[i].insert(2, ' ')
            elif x[i][0] in dahta:
                x[i].insert(0, ' ')

        if len(x[i]) == 2:
            if x[i][0] in yekan:
                print('لطفااعداد را با فرمت صحیح وارد کنید')
                exit()
            if x[i][0] in sadgan and x[i][1] in dahgan:
                x[i].insert(2, ' ')
            elif x[i][0] in sadgan and x[i][1] in yekan:
                x[i].insert(1, ' ')
            elif x[i][0] in sadgan and x[i][1] in dahta:
                x[i].insert(2, '')
            elif x[i][0] in dahgan and x[i][1] in yekan:
                x[i].insert(0, ' ')


if x[0][0] == ' ':
    x[0][0] = ''
    if x[0][1] == ' ':
        x[0][1] = ''
result = ''
try:
    for i in range(0, len(x), 2):
        for j in range(len(x[i])):
            result += str(li[x[i][j]])
    result += '0'
    result = int(result)
    print(f"{result:,} ریال")
except:
    print('لطفااعداد را با فرمت صحیح وارد کنید')
